Organise start times and sentences on one line in excel file

In [ ]:
# Mount your Google Drive
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# Read an Excel file for input
import pandas as pd
# This must be changed by the user.
# Please change to the target video name and file path.
video_name = 'video14'
##########################################

import_excel_file_location = '/content/drive/MyDrive/05_workspace/01_msc_project/data/input/excel/youtube_video_subtitle_' + video_name +'.xlsx'
input_book = pd.ExcelFile(import_excel_file_location)

In [ ]:
# Get sheet name
input_sheet_name = input_book.sheet_names
# Get the number of sheets
num_sheet = len(input_sheet_name)
print ("The number of sheet:", num_sheet)
print (input_sheet_name)

The number of sheet: 1
['Sheet1']

In [ ]:
# Read the sheet as a DataFrame
input_sheet_df = input_book.parse(input_sheet_name[0], header=None)
input_sheet_df.head(10)

                                          0
0                                  00:02:00
1  my name is Donna SH and my full-time job
2                                  00:05:00
3      is to count people's arms and us and
4                                  00:08:00
5    like it all started at my first day of
6                                  00:11:00
7         school after my family moved from
8                                  00:14:00
9       Pakistan to Tanzania not from milan

In [ ]:
input_sheet_df.tail(10)

                                           0
324                                 08:14:00
325   TED talk at no time and my speech 30 a
326                                 08:17:00
327    plus and my transcript and I can even
328                                 08:21:00
329  play back my audio and listen to itself
330                                 08:27:00
331                             check it out
332                                 08:29:00
333                               [Applause]

In [ ]:
# Copy original sheet to new sheet
organized_df = input_sheet_df.copy()
length = len(organized_df)
print(length)

# Add new columns
organized_df['start'] = 0.0
organized_df['script'] = ''

334

In [ ]:
# Rename column name (0 => original)
#print(organized_df.columns)
organized_df.rename(columns={0: 'original'}, inplace=True)

In [ ]:
counter = 0

In [ ]:
# Set the end time from the previous start time
for i in range(length):
    #print(i)
    current_value = organized_df.loc[i, 'original']
    
    if i % 2 == 0: 
        organized_df.loc[counter, 'start'] = str(current_value)
    else:
        organized_df.loc[counter, 'script'] = str(current_value)
        counter += 1

In [ ]:
organized_df.drop('original', axis=1, inplace=True)
organized_df

        start                                    script
0    00:02:00  my name is Donna SH and my full-time job
1    00:05:00      is to count people's arms and us and
2    00:08:00    like it all started at my first day of
3    00:11:00         school after my family moved from
4    00:14:00       Pakistan to Tanzania not from milan
..        ...                                       ...
329         0
330         0
331         0
332         0
333         0

[334 rows x 2 columns]

In [ ]:
delele_list = []

In [ ]:
# Delete lines with no value
for i in range(length):
    #print(i)
    current_value = organized_df.loc[i, 'script']
    #print(i, current_value)

    if not current_value: 
        delele_list.append(i)

In [ ]:
# Delele lines with no value
organized_df = organized_df.drop(delele_list, axis=0)
organized_df

        start                                    script
0    00:02:00  my name is Donna SH and my full-time job
1    00:05:00      is to count people's arms and us and
2    00:08:00    like it all started at my first day of
3    00:11:00         school after my family moved from
4    00:14:00       Pakistan to Tanzania not from milan
..        ...                                       ...
162  08:14:00    TED talk at no time and my speech 30 a
163  08:17:00     plus and my transcript and I can even
164  08:21:00   play back my audio and listen to itself
165  08:27:00                              check it out
166  08:29:00                                [Applause]

[167 rows x 2 columns]

In [ ]:
# Export an excel file
import pandas as pd

export_excel_file_location = '/content/drive/MyDrive/05_workspace/01_msc_project/data/output/02_organized_excel/02_organized_excel_' + video_name +'.xlsx'
organized_df.to_excel(export_excel_file_location)